benchmarks/20260808T170324Z/results/gemma-4-12b-it-NVFP4/gemma-4-12b-it-NVFP4__warmup__1.stdout.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e65faafbce0>, trust_remote_code=False, seed=0, num_prompts=5, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='unsloth/gemma-4-12b-it-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/gemma4-benchmark/results/gemma-4-12b-it-NVFP4', result_filename='gemma-4-12b-it-NVFP4__warmup__1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-4b07d603-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-08 17:01:56 [utils.py:90] Sampling input_len from [512, 512] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     5         
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  24.99     
Total input tokens:                      2626      
Total generated tokens:                  2560      
Request throughput (req/s):              0.20      
Output token throughput (tok/s):         102.45    
Peak output token throughput (tok/s):    110.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          207.55    
---------------Time to First Token----------------
Mean TTFT (ms):                          314.61    
Median TTFT (ms):                        61.80     
P50 TTFT (ms):                           61.80     
P90 TTFT (ms):                           821.09    
P99 TTFT (ms):                           1276.08   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.16      
Median TPOT (ms):                        9.17      
P50 TPOT (ms):                           9.17      
P90 TPOT (ms):                           9.18      
P99 TPOT (ms):                           9.18      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4997.10   
Median E2EL (ms):                        4747.88   
P50 E2EL (ms):                           4747.88   
P90 E2EL (ms):                           5508.41   
P99 E2EL (ms):                           5960.82   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/5 [00:00<?, ?it/s]
 20%|██        | 1/5 [00:06<00:24,  6.01s/it]
 40%|████      | 2/5 [00:10<00:15,  5.27s/it]
 60%|██████    | 3/5 [00:15<00:10,  5.02s/it]
 80%|████████  | 4/5 [00:20<00:04,  4.91s/it]
100%|██████████| 5/5 [00:24<00:00,  4.86s/it]
100%|██████████| 5/5 [00:24<00:00,  5.00s/it]